In [34]:
# standard libraries
import pandas as pd
import numpy as np
import os.path

from sklearn.model_selection import train_test_split

# own helper module
from Helpers_Preprocessing import preprocessing as hlp

In [35]:
df = pd.read_csv('C:~your_path~/RecSys/obtained_data/df_complete.csv')
df_pol = pd.read_csv('C:/~your_path~/RecSys/obtained_data/df_pol_BSc.csv')
df_edu = pd.read_csv('C:/~your_path~/RecSys/obtained_data/df_edu_BSc.csv')

In [36]:
df = df.drop(['Geography'], axis = 1) # for now this column is not needed
df.head()

  CourseID  StudentID  Grades
0  T100007          1    5.25
1  T100005          1    5.00
2  T107005          1    4.50
3  T100000          1    5.00
4  T100001          1    4.50

In [37]:
df_pol= df_pol.drop(['Geography'], axis = 1)
df_pol.head()

  CourseID  StudentID  Grades
0  T100007          1    5.25
1  T100005          1    5.00
2  T107005          1    4.50
3  T100000          1    5.00
4  T100001          1    4.50

In [38]:
df_edu.head()

  CourseID  StudentID  Grades
0   742002        301    5.25
1   742001        301    4.75
2   742007        301    5.00
3   742000        301    5.50
4   742067        301    5.50

## 1) Splitting into Training and Test Sets

The challenge of splitting the data into training and test sets for the different learning algorithms is to maintain student-course integrity. The pre-implemented method *'train_test_split'* from scikit learn will not necessarily seperate the data such that the course selection per student will remain complete. This is solved by shuffleing and splitting only the 'unique_index_list' and then obtain the data and merge it into a dataframe.

### 1.1) Complete Dataframe (for Collaborative Filtering RecSys)

In [39]:
unique_index_list = df['StudentID'].unique()

In [40]:
train_students, test_students = train_test_split(unique_index_list, test_size = 0.2, shuffle = True, random_state = 32)

In [41]:
len(train_students) #480 students for training the different recommendation approaches

480

In [42]:
len(test_students) #120 students for testing the recommendation results

120

In [43]:
train_df = hlp.get_student_data(train_students, df)

In [44]:
train_df.head() # merged all indices that where randomly assigend to be training subjects to a dataframe

      CourseID  StudentID  Grades
19924   742001        521    5.25
19925   742006        521    4.75
19926   742002        521    4.50
19927   742007        521    4.50
19928   742067        521    4.25

In [45]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 18784 entries, 19924 to 21507
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   CourseID   18784 non-null  object
 1   StudentID  18784 non-null  int64
 2   Grades     18784 non-null  float64
dtypes: float64(1), int64(1), object(1)
memory usage: 587.0+ KB

In [46]:
len(train_df['StudentID'].unique()) 
# validating that the number of unique indices is the same as the number of training subjects assigned

480

In [47]:
test_df = hlp.get_student_data(test_students, df)

In [48]:
len(test_df['StudentID'].unique())
# validating that the number of unique indices is the same as the number of test subjects assigned

120

In [49]:
#save the state of the training data
train_df.to_csv(os.path.join('C:/~your_path~/RecSys/obtained_data', 'train_df.csv'), index = False)

In [50]:
# save the state of true test data
test_df.to_csv(os.path.join('C:/~your_path~/RecSys/obtained_data', 'test_df.csv'), index = False)

### 1.2) Splitting per Study Program (for Reinforcement Learning RecSys)

In [51]:
unique_index_list_pol = df_pol['StudentID'].unique()
train_students_pol, test_students_pol = train_test_split(unique_index_list_pol, test_size = 0.2, shuffle = True, random_state = 32)

In [52]:
train_df_pol = hlp.get_student_data(train_students_pol, df_pol)
train_df_pol.head()

     CourseID  StudentID  Grades
5315  T100007        157    5.00
5316  T100005        157    5.00
5317  T107005        157    5.75
5318  T100000        157    4.00
5319  T100001        157    5.25

In [53]:
len(train_df_pol['StudentID'].unique()) # 240
len(train_students_pol) # 240

240

In [54]:
test_df_pol = hlp.get_student_data(test_students_pol, df_pol)
test_df_pol.head()

     CourseID  StudentID  Grades
9046  T100007        266    4.75
9047  T100005        266    5.50
9048  T107005        266    5.75
9049  T100000        266    5.00
9050  T100001        266    5.25

In [55]:
len(test_df_pol['StudentID'].unique()) # 60
len(test_students_pol) # 60

60

In [56]:
train_df_pol.to_csv(os.path.join('C:/~your_path~/RecSys/obtained_data', 'train_df_pol.csv'), index = False)
test_df_pol.to_csv(os.path.join('C:/~your_path~/RecSys/obtained_data', 'test_df_pol.csv'), index = False)

In [57]:
unique_index_list_edu = df_edu['StudentID'].unique()
train_students_edu, test_students_edu = train_test_split(unique_index_list_edu, test_size = 0.2, shuffle = True, random_state = 32)

In [58]:
train_df_edu = hlp.get_student_data(train_students_edu, df_edu)
train_df_edu.head()

     CourseID  StudentID  Grades
6864   742007        457    4.50
6865   742006        457    5.00
6866   742004        457    5.50
6867   742003        457    4.25
6868   742062        457    6.00

In [59]:
test_df_edu = hlp.get_student_data(test_students_edu, df_edu)
test_df_edu.head()

      CourseID  StudentID  Grades
11660   742002        566    5.00
11661   742003        566    4.25
11662   742007        566    5.25
11663   742004        566    5.25
11664   742067        566    5.00

In [60]:
len(train_df_edu['StudentID'].unique()) # 60
len(train_students_edu)

240

In [61]:
len(test_df_edu['StudentID'].unique()) # 60
len(test_students_edu)

60

In [62]:
# saving the states of training and test sets 
train_df_edu.to_csv(os.path.join('C:~your_path~/RecSys/obtained_data', 'train_df_edu.csv'), index = False)
test_df_edu.to_csv(os.path.join('C:~your_path~/RecSys/obtained_data', 'test_df_edu.csv'), index = False)


## 2) Prepping the test subjects for offline evaluation

In order to evaluate the different approaches offline, the true test set from the previous step is taken and some entries are removed. As the course selection per students starts with the first course they took and ends with the last course they took before graduating, hence the time progression of the students course selection is respected, one can approximate the in which semester of a test subject might be in, depending on how many courses have already been taken. <br>
<br>
In this analysis ten entries are removed, which will approximate the last year of the Bachelor studies for both programs. Ten recommendations for each test subject are made and compared to the true course selection at a later step.

### 2.1) Complete Dataset

In [63]:
test_ids = test_df['StudentID'].unique()
len(test_ids)

120

In [64]:
test_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4660 entries, 10772 to 5867
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   CourseID   4660 non-null   object
 1   StudentID  4660 non-null   int64
 2   Grades     4660 non-null   float64
dtypes: float64(1), int64(1), object(1)
memory usage: 145.6+ KB

In [65]:
count = 0
for i in range(len(test_ids)):
    if test_ids[i] > 300:
        count += 1
count
# There are 120 test students, 57 belong to the bachelor of educational science. Roughly even distribution!

57

In [66]:
n_entries = -10
test_df_NaN = hlp.remove_entries(test_df, n_entries)

In [67]:
test_df_NaN.tail(11) #last 10 are removed

     CourseID  StudentID  Grades
5857  T207002        172    4.25
5858  T206060        172     NaN
5859  T207004        172     NaN
5860  T207036        172     NaN
5861   J2D035        172     NaN
5862  T207002        172     NaN
5863     5869        172     NaN
5864     5870        172     NaN
5865  T206057        172     NaN
5866  T206024        172     NaN
5867  T208014        172     NaN

In [68]:
# saving state of the test set with removed entries
test_df_NaN.to_csv(os.path.join('C:/~your_path~/RecSys/obtained_data', 'test_df_NaN.csv'), index = False)

### 2.2) Each Study Program individually
This is needed for the Reinforcement-based Recommendation System!!

In [69]:
n_entries = -10
test_df_NaN_pol = hlp.remove_entries(test_df_pol, n_entries)
test_df_NaN_edu = hlp.remove_entries(test_df_edu, n_entries)

In [70]:
test_df_NaN_pol.tail(11)

     CourseID  StudentID  Grades
3949  T207002        116    4.75
3950  T206060        116     NaN
3951  T207034        116     NaN
3952  T207036        116     NaN
3953  T207059        116     NaN
3954   J2D035        116     NaN
3955     5869        116     NaN
3956     5870        116     NaN
3957  T205027        116     NaN
3958  T205020        116     NaN
3959  T206056        116     NaN

In [71]:
test_df_NaN_edu.tail(11)

     CourseID  StudentID  Grades
5093   742386        416    4.75
5094    74146        416     NaN
5095   7422A5        416     NaN
5096   7422A8        416     NaN
5097   7422A7        416     NaN
5098    7417I        416     NaN
5099   7422AN        416     NaN
5100   742452        416     NaN
5101   742483        416     NaN
5102   742516        416     NaN
5103   742514        416     NaN

In [72]:
# saving state of the test set with removed entries 
test_df_NaN_pol.to_csv(os.path.join('C:/~your_path~/RecSys/obtained_data', 'test_df_NaN_pol.csv'), index = False)
test_df_NaN_edu.to_csv(os.path.join('C:/~your_path~/RecSys/obtained_data', 'test_df_NaN_edu.csv'), index = False)